[
    "TSM, aka \"Tribe of Silver Monkeys,\" is a team in Riot Games' Minor League that is often ridiculed for being washed-up and having an owner that looks like Wukong. It is specifically known for its obnoxious fanbase and mind-numbing throws.",
    "TSM, aka \"Throws Six Matches,\" is a North American team known for their questionable play and inability to win a game. They are currently found in Gate 06 of the Shanghai Pudong Airport making up excuses for not winning a single game at Worlds.",
    "TSM, aka \"Took Swordart's Mercedes,\" is a professional scamming and money laundering agency that covers its operations using poorly managed esports teams.",
    "TSM, aka \"Tossed Six Million,\" is a North American investment firm often known for their innovative investment strategy of burning up money and failing to return any meaningful results.",
    "TSM, aka \"Total Shitshow Manifested,\" is a team that plays for Riot Games' Minor League that is often ridiculed for its inability to make it to international competitions. It is specifically known for fielding dogshit lineups centered around a washed up Bjergsen.",
    "TSM, aka \"Team Super Mald,\" is a team in Riot Games' Minor League that is often ridiculed for being washed-up and having an owner that looks like Wukong. It is specifically known for its obnoxious fanbase and mind-numbing throws such as the recent Clutch Gaming reverse sweep.",
    "TSM, aka \"Top Support Meta\", is a semiconductor manufacturing organisation known for picking enchanter support champions for their top laner to complement their hypercarry ADC.",
    "TSM, aka \"Talent Suppression Machine,\" is a North American esport organisation rely on EU players. Recently their GM hired her boyfriend to play for their team in place of a superstar EU ADC. They neglect to solve their issues and blame Lenovo.",
    "TSM, aka \"Two Successful Matches,\" is a North American League of Legends team. They are most known for winning only 2 games during Season 2022 as well as allegations of workplace misconduct.",
    "TSM, aka \"They Suck Man\", is a North American team known for losing games in LCS.",
    "TSM, aka \"Their Selling Manager\", is a team known for selling their house, car and clothes, and everything to sign the best talent so as to not become CLG."
]
